In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {
    'A':[1,2, np.nan],
    'B':[5, np.nan, np.nan],
    'C':[1,2,3]
}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [3]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [4]:
df.dropna(axis =0)

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis =1)

   C
0  1
1  2
2  3

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.fillna(value = 'Filling Value')

               A              B  C
0            1.0            5.0  1
1            2.0  Filling Value  2
2  Filling Value  Filling Value  3

In [17]:
df = pd.DataFrame(d)

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:
a = df['A'].fillna(value = df['A'].mean())

NameError: name 'a' is not defined

In [27]:
a = df['A'].fillna(value = df['A'].mean())

In [28]:
a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [33]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
df['A'].fillna(value = df['A'].mean(), inplace = True)
df

C:\Users\kani\AppData\Local\Temp\ipykernel_348996\4028766332.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value = df['A'].mean(), inplace = True)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [36]:
data = {
    'Company':['Google', 'google','MSFT','FB','FB','IBM'],
    'person':['Sam','Nihad','Any','Van','Rakib','Ovi'],
    'sales':[200,120,340,124,243,350]
}
df = pd.DataFrame(data)

In [39]:
df

  Company person  sales
0  Google    Sam    200
1  google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [45]:
byComp = df.groupby('Company')
byComp.mean(numeric_only=True)

         sales
Company
FB       183.5
Google   200.0
IBM      350.0
MSFT     340.0
google   120.0

In [46]:
df

  Company person  sales
0  Google    Sam    200
1  google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350